# DemandFlowAndPressureLossNotSetInLossFamily Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPCalculationFailures..::..DemandFlowAndPressureLossNotSetInLossFamily Property
BuiltInFailures..::..MEPCalculationFailures Class See Also
---
A calculation did not complete because the pressure loss value for element is not set. Select the element and enter a value for the Pressure Loss.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DemandFlowAndPressureLossNotSetInLossFamily { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DemandFlowAndPressureLossNotSetInLossFamily As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DemandFlowAndPressureLossNotSetInLossFamily {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPCalculationFailures Class
Autodesk.Revit.DB Namespace